cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "teamookla/speedtest"

# packages
brew "ack"
brew "bat"
brew "curl"
brew "fzf"
brew "gcc"
brew "git"
brew "htop"
brew "neovim"
brew "python@3.8"
brew "speedtest-cli"
brew "swi-prolog"
brew "tmux"
brew "vim"
brew "wget"
brew "zsh"
brew "teamookla/speedtest/speedtest"

# casks
cask "discord"
cask "google-chrome"
cask "iterm2"
cask "mactex"
cask "moom"
cask "slack"
cask "smoothscroll"
cask "spotify"
