cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jason0x43/neovim-nightly"
tap "teamookla/speedtest"
tap "zegervdv/zathura"
tap "homebrew/cask-fonts"

# packages
brew "ack"
brew "bat"
brew "choose-gui"
brew "curl"
brew "fzf"
brew "gcc"
brew "git"
brew "htop"
brew "neovim"
brew "python@3.8"
brew "speedtest-cli"
brew "swi-prolog"
brew "tmux"
brew "vim"
brew "wget"
brew "zsh"
brew "teamookla/speedtest/speedtest"
brew "zegervdv/zathura/zathura", args: ["with-synctex"]
brew "zegervdv/zathura/zathura-pdf-poppler"
brew "mas"

# casks
cask "discord"
cask "google-chrome"
cask "inkscape"
cask "iterm2"
cask "mactex"
cask "slack"
cask "smoothscroll"
cask "spotify"
cask "font-jetbrains-mono"

" mac store apps
mas "Microsoft OneNote", id: 784801555
mas "Whatsapp", id: 1147396723
mas "Dropover", id: 1355679052
mas "Moom", id: 419330170
mas "WiFi Explorer Lite", id: 1408727408
